Update COMPANY_README.md
